{
  "viewname" : "article",
  "sparql": " PREFIX dc: <http://purl.org/dc/elements/1.1/> PREFIX rdf:  <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX bench: <http://localhost/vocabulary/bench/> SELECT * WHERE { ?article rdf:type bench:Article . ?article dc:creator ?person .} ",
  "jsonschema": { "type":"object", "properties":{
    "results": {
    "type":"array", "items":{
    "type":"object", "properties":{
    "?label": { "type":"string" },
    "?value": { "type":"string" } }}}}},
  "endpoint": "http://130.158.76.22:8890/sparql"
}
