{
  "viewname" : "Paper",
  "sparql": "prefix dc: <http://purl.org/dc/elements/1.1/> select * from <http://paper.test/> where { ?paperID dc:title ?paperTitle }",
  "jsonschema": { "type":"object", "properties":{
    "results": {
    "type":"array", "items":{
    "type":"object", "properties":{
    "?label": { "type":"string" },
    "?value": { "type":"string" } }}}}},
  "endpoint": "http://127.0.0.1:8890/sparql"
}
