{
  "viewname" : "product",
  "sparql": "DEFINE get:refresh \"0\" DEFINE get:soft \"replace\" PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX bsbm: <http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01/vocabulary/> PREFIX dc: <http://purl.org/dc/elements/1.1/> SELECT * WHERE { ?prdct rdf:type bsbm:Product . ?prdct rdfs:label ?prdctlbl . ?prdct bsbm:productFeature ?prdctft . ?prdct rdf:type ?ptype . ?prdct bsbm:productPropertyNumeric1 ?value1 . ?prdct dc:date ?pdate . ?prdct bsbm:producer ?pd . } ",
  "jsonschema": { "type":"object", "properties":{
    "results": {
    "type":"array", "items":{
    "type":"object", "properties":{
    "?prdct": { "type":"string" },
    "?prdctlbl": { "type":"string" },
    "?prdctft": {"type":"string"},
    "?pd": {"type":"string"},
    "?ptype": {"type":"string"},
    "?value1": {"type":"number"},
    "?pdate": { "type":"string" }   }}}}},
  "endpoint": "http://130.158.76.30:8890/sparql"
}
