{
  "viewname" : "Product",
  "sparql": "DEFINE get:refresh \"0\" DEFINE get:soft \"replace\" PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX bsbm: <http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01/vocabulary/> SELECT * WHERE { ?prdct rdf:type bsbm:Product . ?prdct rdfs:label ?prdctlbl . ?prdct bsbm:productFeature ?prdctft . ?prdct bsbm:productPropertyNumeric1 ?value1 } ",
  "jsonschema": { "type":"object", "properties":{
    "results": {
    "type":"array", "items":{
    "type":"object", "properties":{
    "?prdct": { "type":"string" },
    "?prdctlbl": { "type":"string" },
    "?prdctft": {"type":"string"},
    "?value1": {"type":"number"} }}}}},
  "endpoint": "http://130.158.76.22:8890/sparql"
}
