{
  "viewname" : "Prof",
  "sparql": "prefix Prof: <http://prof.test/> prefix Lab: <http://lab.test/> select * where { ?profID Prof:Name ?Name . ?profID Lab:ID ?labID . }",
  "jsonschema": { "type":"object", "properties":{
    "results": {
    "type":"array", "items":{
    "type":"object", "properties":{
    "?label": { "type":"string" },
    "?value": { "type":"string" } }}}}},
  "endpoint": "http://127.0.0.1:8890/sparql"
}
